; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v10 ?v13)
             (pred_5 ?v1 ?v4)
             (pred_12 ?v10 ?v4)
             (pred_1 ?v11 ?v10 )
	     (pred_4 ?v10)
             (pred_10 ?v9)
             (pred_6 ?v1)
             (pred_7 ?v4)
             (pred_3 ?v10)
             (pred_11 ?v1)
             (pred_9 ?v10)
             (pred_2 ))



(:action op_4
:parameters (?v5 ?v12 ?v6 ?v3)
:precondition (and (pred_10 ?v5) (pred_10 ?v12) (pred_6 ?v6) (pred_7 ?v3)
          (pred_8 ?v5 ?v12) (pred_5 ?v6 ?v3)
                   (pred_12 ?v12 ?v3) (pred_4 ?v5) 
                   (pred_3 ?v12) (pred_11 ?v6))
:effect (and  (pred_9 ?v12) (not (pred_3 ?v12))))


(:action op_1
:parameters (?v5 ?v8)
:precondition (and (pred_10 ?v5) (pred_10 ?v8)
               (pred_4 ?v5) (pred_8 ?v5 ?v8) (pred_9 ?v8))
:effect (and (pred_4 ?v8) (not (pred_4 ?v5))))

(:action op_3
:parameters (?v5 ?v6)
:precondition (and (pred_10 ?v5) (pred_6 ?v6) 
                  (pred_4 ?v5) (pred_1 ?v6 ?v5) (pred_2 ))
:effect (and (pred_11 ?v6)
   (not (pred_1 ?v6 ?v5)) (not (pred_2 ))))


(:action op_2
:parameters (?v5 ?v2 ?v7)
:precondition (and (pred_10 ?v5) (pred_6 ?v2) (pred_6 ?v7)
                  (pred_4 ?v5) (pred_11 ?v7) (pred_1 ?v2 ?v5))
:effect (and (pred_11 ?v2) (pred_1 ?v7 ?v5)
        (not (pred_11 ?v7)) (not (pred_1 ?v2 ?v5))))

(:action op_5
:parameters (?v5 ?v6)
:precondition (and (pred_10 ?v5) (pred_6 ?v6) 
                  (pred_4 ?v5) (pred_11 ?v6))
:effect (and (pred_2 ) (pred_1 ?v6 ?v5) (not (pred_11 ?v6)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_26 obj_13 obj_09 obj_29 obj_04 obj_27 obj_16 obj_31 obj_03 obj_24 obj_07 obj_12 obj_20 obj_06 obj_25 obj_21 obj_10 obj_28 obj_18 obj_22 obj_30 obj_11 obj_05 obj_14 obj_01
    obj_08 obj_15 obj_23
    obj_19 obj_17 obj_32 obj_02
    )

    (:init
       (pred_2)

       (pred_10 obj_26)
       (pred_10 obj_13)
       (pred_10 obj_09)
       (pred_10 obj_29)
       (pred_10 obj_04)
       (pred_10 obj_27)
       (pred_10 obj_16)
       (pred_10 obj_31)
       (pred_10 obj_03)
       (pred_10 obj_24)
       (pred_10 obj_07)
       (pred_10 obj_12)
       (pred_10 obj_20)
       (pred_10 obj_06)
       (pred_10 obj_25)
       (pred_10 obj_21)
       (pred_10 obj_10)
       (pred_10 obj_28)
       (pred_10 obj_18)
       (pred_10 obj_22)
       (pred_10 obj_30)
       (pred_10 obj_11)
       (pred_10 obj_05)
       (pred_10 obj_14)
       (pred_10 obj_01)
       (pred_7 obj_08)
       (pred_7 obj_15)
       (pred_7 obj_23)
       (pred_6 obj_19)
       (pred_6 obj_17)
       (pred_6 obj_32)
       (pred_6 obj_02)

       (pred_8 obj_26 obj_27)
       (pred_8 obj_26 obj_13)
       (pred_8 obj_13 obj_16)
       (pred_8 obj_13 obj_09)
       (pred_8 obj_13 obj_26)
       (pred_8 obj_09 obj_31)
       (pred_8 obj_09 obj_29)
       (pred_8 obj_09 obj_13)
       (pred_8 obj_29 obj_03)
       (pred_8 obj_29 obj_04)
       (pred_8 obj_29 obj_09)
       (pred_8 obj_04 obj_24)
       (pred_8 obj_04 obj_29)
       (pred_8 obj_27 obj_07)
       (pred_8 obj_27 obj_16)
       (pred_8 obj_27 obj_26)
       (pred_8 obj_16 obj_12)
       (pred_8 obj_16 obj_31)
       (pred_8 obj_16 obj_13)
       (pred_8 obj_16 obj_27)
       (pred_8 obj_31 obj_20)
       (pred_8 obj_31 obj_03)
       (pred_8 obj_31 obj_09)
       (pred_8 obj_31 obj_16)
       (pred_8 obj_03 obj_06)
       (pred_8 obj_03 obj_24)
       (pred_8 obj_03 obj_29)
       (pred_8 obj_03 obj_31)
       (pred_8 obj_24 obj_25)
       (pred_8 obj_24 obj_04)
       (pred_8 obj_24 obj_03)
       (pred_8 obj_07 obj_21)
       (pred_8 obj_07 obj_12)
       (pred_8 obj_07 obj_27)
       (pred_8 obj_12 obj_10)
       (pred_8 obj_12 obj_20)
       (pred_8 obj_12 obj_16)
       (pred_8 obj_12 obj_07)
       (pred_8 obj_20 obj_28)
       (pred_8 obj_20 obj_06)
       (pred_8 obj_20 obj_31)
       (pred_8 obj_20 obj_12)
       (pred_8 obj_06 obj_18)
       (pred_8 obj_06 obj_25)
       (pred_8 obj_06 obj_03)
       (pred_8 obj_06 obj_20)
       (pred_8 obj_25 obj_22)
       (pred_8 obj_25 obj_24)
       (pred_8 obj_25 obj_06)
       (pred_8 obj_21 obj_30)
       (pred_8 obj_21 obj_10)
       (pred_8 obj_21 obj_07)
       (pred_8 obj_10 obj_11)
       (pred_8 obj_10 obj_28)
       (pred_8 obj_10 obj_12)
       (pred_8 obj_10 obj_21)
       (pred_8 obj_28 obj_05)
       (pred_8 obj_28 obj_18)
       (pred_8 obj_28 obj_20)
       (pred_8 obj_28 obj_10)
       (pred_8 obj_18 obj_14)
       (pred_8 obj_18 obj_22)
       (pred_8 obj_18 obj_06)
       (pred_8 obj_18 obj_28)
       (pred_8 obj_22 obj_01)
       (pred_8 obj_22 obj_25)
       (pred_8 obj_22 obj_18)
       (pred_8 obj_30 obj_11)
       (pred_8 obj_30 obj_21)
       (pred_8 obj_11 obj_05)
       (pred_8 obj_11 obj_10)
       (pred_8 obj_11 obj_30)
       (pred_8 obj_05 obj_14)
       (pred_8 obj_05 obj_28)
       (pred_8 obj_05 obj_11)
       (pred_8 obj_14 obj_01)
       (pred_8 obj_14 obj_18)
       (pred_8 obj_14 obj_05)
       (pred_8 obj_01 obj_22)
       (pred_8 obj_01 obj_14)
       (pred_3 obj_14)
       (pred_3 obj_26)
       (pred_3 obj_21)
       (pred_3 obj_10)
       (pred_12  obj_14 obj_08)
       (pred_12  obj_26 obj_15)
       (pred_12  obj_21 obj_23)
       (pred_12  obj_10 obj_15)
       (pred_9 obj_13)
       (pred_9 obj_09)
       (pred_9 obj_29)
       (pred_9 obj_04)
       (pred_9 obj_27)
       (pred_9 obj_16)
       (pred_9 obj_31)
       (pred_9 obj_03)
       (pred_9 obj_24)
       (pred_9 obj_07)
       (pred_9 obj_12)
       (pred_9 obj_20)
       (pred_9 obj_06)
       (pred_9 obj_25)
       (pred_9 obj_28)
       (pred_9 obj_18)
       (pred_9 obj_22)
       (pred_9 obj_30)
       (pred_9 obj_11)
       (pred_9 obj_05)
       (pred_9 obj_01)

       (pred_5  obj_19 obj_08)
       (pred_5  obj_17 obj_15)
       (pred_5  obj_32 obj_23)
       (pred_5  obj_02 obj_23)
       (pred_1 obj_19 obj_09)
       (pred_1 obj_17 obj_13)
       (pred_1 obj_32 obj_28)
       (pred_1 obj_02 obj_12)
       (pred_4 obj_25)
    )

    (:goal (and
       (pred_1 obj_19 obj_03)
       (pred_1 obj_32 obj_12)
       (pred_1 obj_02 obj_03)
    ))
(:constraints
  (always (not (pred_4 obj_20)))
)
)

; plan
1. (op_1 obj_25 obj_06)
   deleted: (pred_4 obj_25)
   added: (pred_4 obj_06)
   goals met: 0 of 3
2. (op_1 obj_06 obj_18)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_18)
   goals met: 0 of 3
3. (op_1 obj_18 obj_28)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_28)
   goals met: 0 of 3
4. (op_3 obj_28 obj_32)
   deleted: (pred_1 obj_32 obj_28) (pred_2)
   added: (pred_11 obj_32)
   goals met: 0 of 3
5. (op_1 obj_28 obj_18)
   deleted: (pred_4 obj_28)
   added: (pred_4 obj_18)
   goals met: 0 of 3
6. (op_1 obj_18 obj_06)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_06)
   goals met: 0 of 3
7. (op_1 obj_06 obj_03)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_03)
   goals met: 0 of 3
8. (op_1 obj_03 obj_31)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_31)
   goals met: 0 of 3
9. (op_1 obj_31 obj_16)
   deleted: (pred_4 obj_31)
   added: (pred_4 obj_16)
   goals met: 0 of 3
10. (op_1 obj_16 obj_12)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_12)
   goals met: 0 of 3
11. (op_2 obj_12 obj_02 obj_32)
   deleted: (pred_11 obj_32) (pred_1 obj_02 obj_12)
   added: (pred_11 obj_02) (pred_1 obj_32 obj_12)
   goals met: 1 of 3
12. (op_1 obj_12 obj_16)
   deleted: (pred_4 obj_12)
   added: (pred_4 obj_16)
   goals met: 1 of 3
13. (op_1 obj_16 obj_31)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_31)
   goals met: 1 of 3
14. (op_1 obj_31 obj_03)
   deleted: (pred_4 obj_31)
   added: (pred_4 obj_03)
   goals met: 1 of 3
15. (op_5 obj_03 obj_02)
   deleted: (pred_11 obj_02)
   added: (pred_2) (pred_1 obj_02 obj_03)
   goals met: 2 of 3
16. (op_1 obj_03 obj_29)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_29)
   goals met: 2 of 3
17. (op_1 obj_29 obj_09)
   deleted: (pred_4 obj_29)
   added: (pred_4 obj_09)
   goals met: 2 of 3
18. (op_3 obj_09 obj_19)
   deleted: (pred_1 obj_19 obj_09) (pred_2)
   added: (pred_11 obj_19)
   goals met: 2 of 3
19. (op_1 obj_09 obj_29)
   deleted: (pred_4 obj_09)
   added: (pred_4 obj_29)
   goals met: 2 of 3
20. (op_1 obj_29 obj_03)
   deleted: (pred_4 obj_29)
   added: (pred_4 obj_03)
   goals met: 2 of 3
21. (op_5 obj_03 obj_19)
   deleted: (pred_11 obj_19)
   added: (pred_2) (pred_1 obj_19 obj_03)
   goals met: 3 of 3
